CS-3365/notes/html_output/2 - Ethics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-22 Wed 17:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Kieran Lavato" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdc48f8c">1. Ethics</a>
<ul>
<li><a href="#orgbc8a5e2">1.1. Ethical dilemmas</a></li>
<li><a href="#orge5ed406">1.2. Case studies</a>
<ul>
<li><a href="#orga5477ac">1.2.1. A personal insulin pump.</a></li>
<li><a href="#org7889f7f">1.2.2. A mental health case patient managment system</a></li>
<li><a href="#orga13636a">1.2.3. A wilderness weather station.</a></li>
<li><a href="#org7123f64">1.2.4. iLearn System</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgdc48f8c" class="outline-2">
<h2 id="orgdc48f8c"><span class="section-number-2">1.</span> Ethics</h2>
<div class="outline-text-2" id="text-1">
<p>
do NOT distribute ransomware for a wonderful payout (unless you are UMC)
</p>

<p>
Look at the IEEE/ACM code of ethics.
</p>
</div>
<div id="outline-container-orgbc8a5e2" class="outline-3">
<h3 id="orgbc8a5e2"><span class="section-number-3">1.1.</span> Ethical dilemmas</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Disagreement with policies</li>
<li>Employer acting in an unethical way and releases a safety-critical system without finishing and testing the system.</li>
<li>Participating in the development in military weapons systems or nuclear systems.</li>
<li>Other conflicts of interest (between employer and employee.)</li>
</ul>
</div>
</div>
<div id="outline-container-orge5ed406" class="outline-3">
<h3 id="orge5ed406"><span class="section-number-3">1.2.</span> Case studies</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orga5477ac" class="outline-4">
<h4 id="orga5477ac"><span class="section-number-4">1.2.1.</span> A personal insulin pump.</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Details:
</p>
<ul class="org-ul">
<li>Collects data from blood sugar sensor and calculates the amount of insulin required to be injected.</li>
<li>Sends signals to a micro-pump to deliver the correct dose of insulin.</li>
<li>Safety-critical system as low blood sugars can lead to brain malfunctioning, coma, and death.</li>
<li>High blood sugar levels have long-term effects such as kidney disease, etc.</li>
</ul>

<p>
Since it&rsquo;s a safety-critical system, it must be designed and implemented to ensure that the system always meets these two requirements:
</p>
<ol class="org-ol">
<li>The system shall be available to deliver insulin when required.</li>
<li>The system shall perform reliably and deliver the correct amount of insulin to counteract the current level of blood sugar.</li>
</ol>

<p>
Known as an embedded control system.
</p>
</div>
</div>
<div id="outline-container-org7889f7f" class="outline-4">
<h4 id="org7889f7f"><span class="section-number-4">1.2.2.</span> A mental health case patient managment system</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Details:
</p>
<ul class="org-ul">
<li>A patient information system to support mental health care is a medical information system that maintains information about patients suffering from mental health problems and the treatments that they have received.</li>
<li>Most mental health patients do not require dedicated hospital treatment, but need to attend specialist clinics regularly where they can meet a doctor who has detailed knowledge of their problems.</li>
<li>To make it easier for patients to attend, these clinics are not just run in hospitals.</li>
</ul>

<p>
Two purposes for this system:
</p>
<ol class="org-ol">
<li>To generate management information that allows health service managers to assess performance against local and government targets.</li>
<li>To provide medical staff with timely information to support the treatment of patients.</li>
</ol>

<p>
Features:
</p>
<ul class="org-ul">
<li>Individual care management (create and maintain records, treatments, etc.)</li>
<li>Patient monitoring (records problems if present)</li>
<li>Administrative reporting</li>
<li>Privacy</li>
<li>Safety (mental illnesses, government laws, etc.)</li>
</ul>
<p>
2nd system.
</p>
</div>
</div>
<div id="outline-container-orga13636a" class="outline-4">
<h4 id="orga13636a"><span class="section-number-4">1.2.3.</span> A wilderness weather station.</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Details:
</p>
<ul class="org-ul">
<li>The government of a country with large areas of wilderness decides to deploy several hundred weather stations in remote areas.</li>
<li>Weather stations collect data from a set of instruments that measure temperature, pressure ,sunshine, rainfall, wind speed, wind direction (over a 24 hour period.)</li>
</ul>

<p>
Features:
</p>
<ol class="org-ol">
<li>Weather station system (for collecting weather data/telemetry.)</li>
<li>Data management and archiving system (collecting data from all of the wilderness and archives it.)</li>
<li>Station maintenance system (for communicating via satellite.)</li>
</ol>

<p>
Data collection system.
</p>
</div>
</div>
<div id="outline-container-org7123f64" class="outline-4">
<h4 id="org7123f64"><span class="section-number-4">1.2.4.</span> iLearn System</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Details:
</p>
<ul class="org-ul">
<li>A digital learning enviorment is a framework in which a set of general purpose and specially made software.</li>
<li>Browser-based user interface, app</li>
<li>Configuration services such as group management, application, and identity man.</li>
</ul>

<p>
System of systems.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kieran Lavato</p>
<p class="date">Created: 2025-01-22 Wed 17:39</p>
</div>
</body>
</html>
